/****************************************************************************
 *                                                                          *
 * File    : main.c                                                         *
 *                                                                          *
 * Purpose : Console mode (command line) program.                           *
 *                                                                          *
 * History : Date      Reason                                               *
 *           00/00/00  Created                                              *
 *                                                                          *
 ****************************************************************************/

#include <stdio.h>

/****************************************************************************
 *                                                                          *
 * Function: main                                                           *
 *                                                                          *
 * Purpose : Main entry point.                                              *
 *                                                                          *
 * History : Date      Reason                                               *
 *           00/00/00  Created                                              *
 *                                                                          *
 ****************************************************************************/

int main(int argc, char *argv[])
{
  /* TODO: Enter code here */
  int n;
  scanf("%d",&n);
  int sr=0, sl=0; // Сумма цифр правой и левой частей
  char z[n];      // Сами цифры
  scanf("%s",z); // Вводим коды цифр ('0'-48 '1'-49..)
  //Суммирование цифр левой части 
  for(int i=0; i<n/2; i++)
    sl+=z[i]-'0'; // Переводим коды цифр в сами цифры   
  //Суммирование цифр правой части 
  for(int i=n/2; i<n; i++)
    sr+=z[i]-'0'; // Переводим коды цифр в сами цифры 
  int r=(sr==sl); // Равны-1; 0-нет
  printf("%d\n",r);
  return 0;
}

